[
  {
    "title": "DSA to Development: A Complete Guide",
    "url": "https://www.geeksforgeeks.org/courses/dsa-to-development-coding-guide",
    "description": "This course is designed to take you on a transformative journey from mastering Data Structures and Algorithms (DSA) to becoming a proficient developer. Whether you aspire to become a full-stack developer or specialize in a specific technology stack, this course provides the essential building blocks for your coding journey starting right from basic programming to building applications.",
    "image": "https ://media.geeksforgeeks.org/img-practice/prod/courses/504/Mobile/Other/Course_DSA_to_Dev_1720846081.webp"
  },
  {
    "title": "JAVA Backend Development - Live",
    "url": "https://www.geeksforgeeks.org/courses/Java-backend-live",
    "description": "The JAVA Backend Development - Live course is designed to teach you how to build powerful and efficient backend systems using Java. This extensive Java Backend Development course is a 12-week guided program to equip you with the right skills and make you interview-ready. Not only this, get hands-on experience in building web apps like e-wallets, movie ticket booking, etc.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/227/Mobile/Other/Course_Backend_1720846992.webp"
  },
  {
    "title": "Complete Machine Learning & Data Science Program",
    "url": "https://www.geeksforgeeks.org/courses/data-science-live",
    "description": "The Complete Machine Learning & Data Science Program is a comprehensive live course designed to take you from beginner to expert in machine learning and data science. Explore a 360-degree learning experience designed for geeks who wish to get hands-on Data Science and ML. Mentored by industry experts; learn to apply DS methods and techniques, and acquire analytical skills. Join us to gain practical knowledge and become proficient in Data Science.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/405/Mobile/Other/Course_ML_&_DS_1720846555.webp"
  },
  {
    "title": "Placement Tayyari With DSA",
    "url": "https://www.geeksforgeeks.org/courses/placement-prep-programming-data-structures-algorithm",
    "description": "Struggling with coding interviews? It’s often due to weak DSA knowledge or lack of fluency in a programming language. If your goal is to land your dream job at companies like Google, Amazon, Microsoft, or Meta, mastering both is essential. This course will take you from beginner to expert—learn a programming language from scratch and build strong DSA foundations. Practice with handpicked MAANG-inspired problems and tackle real-world scenarios to sharpen your skills. Let’s get you interview-ready",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/891/Mobile/Content/Tayyari_1747900034.webp"
  },
  {
    "title": "Full Stack Development with React & Node JS - Project Based Training",
    "url": "https://www.geeksforgeeks.org/courses/full-stack-node-live-hybrid",
    "description": "Welcome to the 6-Week Full Stack Practical Training Program – FSRNL-Live is an immersive, hands-on course designed to transform you into a job-ready MERN stack developer. Through live, instructor-led sessions, you’ll build numerous real-world projects and gain deep practical experience in frontend and backend development.From dynamic UIs to fully functional APIs, from authentication systems to a complete e-commerce platform - you’ll not just learn full stack development, you’ll live it.",
    "image": "https://media.geeksforgeeks.org/wp-content/uploads/20250628094526/FullStackDevelopmentpng.png"
  },
  {
    "title": "Tech Interview 101 - From DSA to System Design for Working Professionals",
    "url": "https://www.geeksforgeeks.org/courses/interviewe-101-data-structures-algorithm-system-design",
    "description": "Why do Professionals in Software Engineering often struggle to create efficient and scalable systems?Well, the solution lies in integrating DSA principles effectively into real-world System Design scenarios. If you want to learn this in order to crack the Tech Giants, register now!!!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/458/Mobile/Other/Course_Tech_Int_1720846791.webp"
  },
  {
    "title": "DevOps Engineering - Planning to Production",
    "url": "https://www.geeksforgeeks.org/courses/devops-live",
    "description": "Get ready to revolutionize your process & take your career to the next level with this DevOps - Live course! Gain insights from industry experts on how to make your workflow more efficient & improve the ability to quickly release high-quality software.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/483/Mobile/Other/Course_Devops_1720845934.webp"
  },
  {
    "title": "Data Analytics Training using Excel, SQL, Python & PowerBI",
    "url": "https://www.geeksforgeeks.org/courses/data-analytics-training-program-excel-sql-python-powerbi",
    "description": "Unlock the power of data! Elevate your expertise with our Mastering Data Analytics Course. Gain proficiency in Python, SQL, Excel, and Tableau for data analysis, visualization, and reporting. Explore hands-on real-world projects and much more.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/715/Mobile/Other/data_analytics_1720850111.webp"
  },
  {
    "title": "Complete Interview Preparation",
    "url": "https://www.geeksforgeeks.org/courses/complete-interview-preparation",
    "description": "An interview-centric & placement-preparation course designed to prepare you for the role of SDE for product and service-based companies. Choose between Java, Python OR C++ and learn Resume Building, DSA, Core Subjects, Aptitude, Reasoning, and much more!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/244/Web/Content/CIP_1720782273.webp"
  },
  {
    "title": "Data Structures & Algorithms in Python - Self Paced",
    "url": "https://www.geeksforgeeks.org/courses/Data-Structures-With-Python",
    "description": "The most popular course on DSA by Sandeep Jain, trusted by over 100,000 students is now in Python! Built with years of experience by industry experts this Data Structures & Algorithms in Python course gives you a complete package of video lectures, practice problems, quizzes, discussion forums, contests, and instant doubt-support. Start your DSA with Python journey today!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/261/Web/Content/dspy_1723008711.webp"
  },
  {
    "title": "Mastering System Design: From Low-Level to High-Level Solutions",
    "url": "https://www.geeksforgeeks.org/courses/mastering-system-design-low-level-to-high-level-solutions",
    "description": "Master the art of system design with our comprehensive course, covering low-level and high-level design principles, design patterns, databases, scaling, caching, and more. Solve real-world design problems and enhance your skills to become the next SDE, Tech Lead, or Architect. Join now!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/503/Web/Content/System-Design_1705407692.webp"
  },
  {
    "title": "Data Structures and Algorithms - Self Paced [Online Course]",
    "url": "https://www.geeksforgeeks.org/courses/dsa-self-paced",
    "description": "Most popular course on DSA trusted by over 1,00,000+ students! Built with years of experience by industry experts the course gives you a complete package of video lectures, practice problems, quizzes, discussion forums, and contests. Enrol now to learn and master DSA skills!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/198/Web/Content/dsa_1723009292.webp"
  },
  {
    "title": "MERN Full Stack Web Development",
    "url": "https://www.geeksforgeeks.org/courses/mern-full-stack-development-classroom",
    "description": "GeeksforGeeks presents for the first time ever: Offline Classroom Program on Full Stack Development. You will learn to build dynamic, scalable web applications using MongoDB, Express.js, React, and Node.js - in offline classes and in an interactive manner. So join the classes today to become a MERN Stack Developer!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/500/Mobile/Other/MERN_1720848943.webp"
  },
  {
    "title": "Complete Backend Development Program- Mastering OOPS, Spring Boot, and Microservices",
    "url": "https://www.geeksforgeeks.org/courses/complete-java-backend-development-program",
    "description": "Step into the ever-evolving landscape of Java Backend Development, fueled by Spring Boot, Hibernate, RESTful APIs, Microservices, and more! Enroll in our comprehensive Offline Program, thoughtfully designed to equip you with the skills, hands-on experience, and unwavering self-assurance required to excel in the thriving world of backend development.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/542/Mobile/Other/Course_Backend_1720848540.webp"
  },
  {
    "title": "DSA for Interview Preparation",
    "url": "https://www.geeksforgeeks.org/courses/dsa-interview-preparation-classroom",
    "description": "Join our offline Data Structures and Algorithms course led by experienced mentors from top tech companies. Gain hands-on experience with classroom sessions. Register now!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/499/Mobile/Other/dsa_1720848769.webp"
  },
  {
    "title": "Complete Data Analytics Program",
    "url": "https://www.geeksforgeeks.org/courses/complete-data-analytics-program",
    "description": "Unlock the power of data! Elevate your expertise with our Mastering Data Analytics Course. Gain proficiency in Python, SQL, Excel, and Power BI for data analysis, visualization, and reporting. Explore hands-on real-world projects and much more.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/540/Mobile/Other/Course_CDA_6_11zon_1720848399.webp"
  },
  {
    "title": "C++ Programming Course Online - Complete Beginner to Advanced",
    "url": "https://www.geeksforgeeks.org/courses/cpp-programming-basic-to-advanced",
    "description": "Become an ace in C++ Programming Language and master the C++ programming skills from basics to advanced. This online C++ course is a complete package of videos, notes & contests from basics to STL libraries & algorithms. This CPP course is perfect for beginners as well as professionals. Enrol now to learn and master C++.",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/221/Web/Content/cpp_1723009538.webp"
  },
  {
    "title": "Java Programming Online Course [Complete Beginner to Advanced]",
    "url": "https://www.geeksforgeeks.org/courses/java-online-course-complete-beginner-to-advanced",
    "description": "This comprehensive Java Programming Course covers everything from Java basics, control structures, functions, classes, objects to advanced concepts in Java including Java Collections, Algorithms, etc. Whether you're a complete Java beginner or looking to enhance your Java programming skills, this complete Java course will guide you through every step of your Java journey. Enroll now for expert-led Java training!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/270/Web/Content/CourseJavaProgrammin_1716371938.webp"
  },
  {
    "title": "C Programming Course Online - Learn C with Data Structures",
    "url": "https://www.geeksforgeeks.org/courses/c-Programming-basic-to-advanced",
    "description": "Learn C Programming Language from the best mentor of all time - Sandeep Jain! This C Programming with Data Structures Course will help you master all basic and advanced C concepts. Master the easy-to-learn C language and take your skills to the next level. Start Today!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/287/Web/Content/c_1722949071.webp"
  },
  {
    "title": "Python Full Course Online - Complete Beginner to Advanced",
    "url": "https://www.geeksforgeeks.org/courses/master-python-complete-beginner-to-advanced",
    "description": "Learn Python Programming from scratch with our beginner-friendly complete Python course! Learn Python key concepts like Python basics, Variables, Data types, Input/output, Operators, OOP concepts, and more. Gain hands-on experience with practical exercises to build a solid foundation in Python programming. Enrol now to learn and master Python!",
    "image": "https://media.geeksforgeeks.org/img-practice/prod/courses/256/Web/Content/py_1723007763.webp"
  }
]